Revit 2024 API
BuiltInFailures.SketchFailures.StairClosedBoundaries Property
 Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairClosedBoundaries { get; }
Visual Basic
Public Shared ReadOnly Property StairClosedBoundaries As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairClosedBoundaries {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace